* Question
Beginning with the data base and the rules you formulated in exercise 4.63, devise a rule for adding "greats" to a grandson relationship. This should enable the system to deduce that Irad is the great-grandson of Adam, or that Jabal and Jubal are the great-great-great-great-great-grandsons of Adam. (Hint: Represent the fact about Irad, for example, as ~((great grandson) Adam Irad)~. Write rules that determine if a list ends in the word grandson. Use this to express a rule that allows one to derive the relationship ~((great . ?rel) ?x ?y)~, where ?rel is a list ending in grandson.) Check your rules on queries such as ~((great grandson) ?g ?ggs)~ and ~(?relationship Adam Irad)~.

* Answer
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.63.query.genesis.scm")
  (load "4.62.query.last-pair.scm")
  (install-last-pair)
  ;; Test
  (for-each mc-eval
            (list
             '(assert! (rule ((grandson) ?x ?y) (grandson ?x ?y)))
             '(assert! (rule ((great . ?relation) ?great-relative ?descendant)
                             (and (son ?great-relative ?relative)
                                  (?relation ?relative ?descendant)
                                  (last-pair ?relation (grandson)))))
             '((great grandson) ?x ?y)
             '(?relation adam irad)
             '((great great grandson) ?x ?y)))
#+end_src

#+RESULTS:
#+begin_example

Assertion added to data base.
Assertion added to data base.
Assertion added to data base.
Assertion added to data base.
Assertion added to data base.
Assertion added to data base.
;;; Query results:
((great grandson) mehujael jubal)
((great grandson) irad lamech)
((great grandson) mehujael jabal)
((great grandson) enoch methushael)
((great grandson) cain mehujael)
((great grandson) adam irad)
;;; Query results:
((great grandson) adam irad)
;;; Query results:
((great great grandson) irad jubal)
((great great grandson) enoch lamech)
((great great grandson) irad jabal)
((great great grandson) cain methushael)
((great great grandson) adam mehujael)
#+end_example
